Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0x4100A02C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PENDCH" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PENDCH0" edc:desc="Pending Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH1" edc:desc="Pending Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH2" edc:desc="Pending Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH3" edc:desc="Pending Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH4" edc:desc="Pending Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH5" edc:desc="Pending Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH6" edc:desc="Pending Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH7" edc:desc="Pending Channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH8" edc:desc="Pending Channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH9" edc:desc="Pending Channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH10" edc:desc="Pending Channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH11" edc:desc="Pending Channel 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH12" edc:desc="Pending Channel 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH13" edc:desc="Pending Channel 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH14" edc:desc="Pending Channel 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH15" edc:desc="Pending Channel 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH16" edc:desc="Pending Channel 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH17" edc:desc="Pending Channel 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH18" edc:desc="Pending Channel 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH19" edc:desc="Pending Channel 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH20" edc:desc="Pending Channel 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH21" edc:desc="Pending Channel 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH22" edc:desc="Pending Channel 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH23" edc:desc="Pending Channel 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH24" edc:desc="Pending Channel 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH25" edc:desc="Pending Channel 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH26" edc:desc="Pending Channel 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH27" edc:desc="Pending Channel 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH28" edc:desc="Pending Channel 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH29" edc:desc="Pending Channel 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH30" edc:desc="Pending Channel 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDCH31" edc:desc="Pending Channel 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A030" edc:access="rrrrrrrrrrrrrrrrr--rrrrr----rrrr" edc:cname="ACTIVE" edc:impl="0xFFFF9F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="LVLEX0" edc:desc="Level 0 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX1" edc:desc="Level 1 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX2" edc:desc="Level 2 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVLEX3" edc:desc="Level 3 Channel Trigger Request Executing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="Active Channel ID" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ABUSY" edc:desc="Active Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTCNT" edc:desc="Active Channel Block Transfer Count" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BASEADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="Descriptor Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A038" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRBADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:desc="Write-Back Memory Base Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A03C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4100A040" edc:access="--nnnnnn--nn-----nnnnnnn-n----nn" edc:cname="CHANNEL0CHCTRLA" edc:impl="0x3F307F43" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Channel Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Channel Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIGSRC" edc:desc="Trigger Source" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Only software/event triggers" edc:when="(field &amp; 0x7F) == 0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TRIGACT" edc:desc="Trigger Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="One trigger required for each block transfer" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BURST" edc:desc="One trigger required for each burst transfer" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSACTION" edc:desc="One trigger required for each transaction" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BURSTLEN" edc:desc="Burst Length" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single-beat burst length" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="2BEAT" edc:desc="2-beats burst length" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="3BEAT" edc:desc="3-beats burst length" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="4BEAT" edc:desc="4-beats burst length" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="5BEAT" edc:desc="5-beats burst length" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="6BEAT" edc:desc="6-beats burst length" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="7BEAT" edc:desc="7-beats burst length" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="8BEAT" edc:desc="8-beats burst length" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="9BEAT" edc:desc="9-beats burst length" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="10BEAT" edc:desc="10-beats burst length" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="11BEAT" edc:desc="11-beats burst length" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="12BEAT" edc:desc="12-beats burst length" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="13BEAT" edc:desc="13-beats burst length" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="14BEAT" edc:desc="14-beats burst length" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="15BEAT" edc:desc="15-beats burst length" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="16BEAT" edc:desc="16-beats burst length" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="THRESHOLD" edc:desc="FIFO Threshold" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="1BEAT" edc:desc="Destination write starts after each beat source address read" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="2BEATS" edc:desc="Destination write starts after 2-beats source address read" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="4BEATS" edc:desc="Destination write starts after 4-beats source address read" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="8BEATS" edc:desc="Destination write starts after 8-beats source address read" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A044" edc:access="------nn" edc:cname="CHANNEL0CHCTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Software Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
