Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0x4100A045" edc:access="------nn" edc:cname="CHANNEL0CHPRILVL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PRILVL" edc:desc="Channel Priority Level" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LVL0" edc:desc="Channel Priority Level 0 (Lowest Level)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LVL1" edc:desc="Channel Priority Level 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="LVL2" edc:desc="Channel Priority Level 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="LVL3" edc:desc="Channel Priority Level 3 (Highest Level)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A046" edc:access="nnnn-nnn" edc:cname="CHANNEL0CHEVCTRL" edc:impl="0xF7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVACT" edc:desc="Channel Event Input Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TRIG" edc:desc="Transfer and periodic transfer trigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CTRIG" edc:desc="Conditional transfer trigger" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CBLOCK" edc:desc="Conditional block transfer" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="SSKIP" edc:desc="Skip next block suspend action" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="INCPRI" edc:desc="Increase priority" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EVOMODE" edc:desc="Channel Event Output Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Block event output selection. Refer to BTCTRL.EVOSEL for available selections." edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TRIGACT" edc:desc="Ongoing trigger action" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVIE" edc:desc="Channel Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVOE" edc:desc="Channel Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A047" edc:offset="0x5"/>
      <edc:SFRDef edc:_addr="0x4100A04C" edc:access="-----nnn" edc:cname="CHANNEL0CHINTENCLR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A04D" edc:access="-----nnn" edc:cname="CHANNEL0CHINTENSET" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A04E" edc:access="-----nnn" edc:cname="CHANNEL0CHINTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A04F" edc:access="----nnnn" edc:cname="CHANNEL0CHSTATUS" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Channel Pending" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Channel Fetch Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERR" edc:desc="Channel CRC Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
