Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0x420008A8" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="TIDM0" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match n" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID" edc:desc="Enable Copying of TID n Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008AC" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="TIDM1" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match n" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID" edc:desc="Enable Copying of TID n Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008B0" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="TIDM2" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match n" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID" edc:desc="Enable Copying of TID n Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008B4" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="TIDM3" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match n" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID" edc:desc="Enable Copying of TID n Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008B8" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="WOL" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="IP" edc:desc="IP address" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="MAG" edc:desc="Event enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARP" edc:desc="LAN ARP req" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SA1" edc:desc="WOL specific address reg 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTI" edc:desc="WOL LAN multicast" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008BC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="IPGS" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FL" edc:desc="Frame Length" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008C0" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="SVLAN" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="VLAN_TYPE" edc:desc="User Defined VLAN_TYPE Field" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ESVLAN" edc:desc="Enable Stacked VLAN Processing Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008C4" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TPFCP" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="PEV" edc:desc="Priority Enable Vector" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PQ" edc:desc="Pause Quantum" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SAMB1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Specific Address 1 Mask" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420008CC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SAMT1" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Specific Address 1 Mask" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
