Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0x420009FC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PEFRN" edc:impl="0x3FFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000A00" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x42000A70" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="RLPITR" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RLPITR" edc:desc="Count number of times transition from rx normal idle to low power idle" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000A74" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RLPITI" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RLPITI" edc:desc="Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000A78" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="TLPITR" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TLPITR" edc:desc="Count number of times enable LPI tx bit 20 goes from low to high" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000A7C" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="TLPITI" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TLPITI" edc:desc="Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000A80" edc:offset="0x180"/>
      <edc:SFRDef edc:_addr="0x42000C00" edc:access="--nnnnnnn-------nnnnnnnn-nn---nn" edc:cname="CTRLA" edc:impl="0x3F80FF63" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:desc="Enhanced Resolution" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSYNC" edc:desc="Master Synchronization (only for TCC Slave Instance)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMAOS" edc:desc="DMA One-shot Trigger Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:desc="Capture Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:desc="Capture Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN4" edc:desc="Capture Channel 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN5" edc:desc="Capture Channel 5 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000C04" edc:access="nnnnnnnn" edc:cname="CTRLBCLR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:desc="Ramp Index Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="TCC Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000C05" edc:access="nnnnnnnn" edc:cname="CTRLBSET" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:desc="Ramp Index Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="TCC Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update or double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DMAOS" edc:desc="One-shot DMA trigger" edc:when="(field &amp; 0x7) == 5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000C06" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42000C08" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0x3FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Swrst Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="Ctrlb Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:desc="Status Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Count Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATT" edc:desc="Pattern Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:desc="Wave Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:desc="Compare Channel 0 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:desc="Compare Channel 1 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC2" edc:desc="Compare Channel 2 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC3" edc:desc="Compare Channel 3 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC4" edc:desc="Compare Channel 4 Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC5" edc:desc="Compare Channel 5 Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000C0C" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FCTRLA" edc:impl="0xFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Fault A Source" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Fault input disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INVERT" edc:desc="Inverted MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ALTFAULT" edc:desc="Alternate fault (A or B) state at the end of the previous period" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEEP" edc:desc="Fault A Keeper" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUAL" edc:desc="Fault A Qualification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANK" edc:desc="Fault A Blanking Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Blanking applied from start of the ramp" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Blanking applied from rising edge of the output waveform" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Blanking applied from falling edge of the output waveform" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Blanking applied from each toggle of the output waveform" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESTART" edc:desc="Fault A Restart" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALT" edc:desc="Fault A Halt Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Halt action disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW" edc:desc="Hardware halt action" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SW" edc:desc="Software halt action" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="NR" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHSEL" edc:desc="Fault A Capture Channel" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC0" edc:desc="Capture value stored in channel 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CC1" edc:desc="Capture value stored in channel 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CC2" edc:desc="Capture value stored in channel 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CC3" edc:desc="Capture value stored in channel 3" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CAPTURE" edc:desc="Fault A Capture Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No capture" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Capture on fault" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="LOCMIN" edc:desc="Minimum local detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOCMAX" edc:desc="Maximum local detection" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DERIV0" edc:desc="Minimum and maximum local detection" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMARK" edc:desc="Capture with ramp index as MSB value" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLANKPRESC" edc:desc="Fault A Blanking Prescaler" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANKVAL" edc:desc="Fault A Blanking Time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL" edc:desc="Fault A Filter Value" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000C10" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FCTRLB" edc:impl="0xFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Fault B Source" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Fault input disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INVERT" edc:desc="Inverted MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ALTFAULT" edc:desc="Alternate fault (A or B) state at the end of the previous period" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEEP" edc:desc="Fault B Keeper" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUAL" edc:desc="Fault B Qualification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANK" edc:desc="Fault B Blanking Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Blanking applied from start of the ramp" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Blanking applied from rising edge of the output waveform" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Blanking applied from falling edge of the output waveform" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Blanking applied from each toggle of the output waveform" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESTART" edc:desc="Fault B Restart" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALT" edc:desc="Fault B Halt Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Halt action disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW" edc:desc="Hardware halt action" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SW" edc:desc="Software halt action" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="NR" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHSEL" edc:desc="Fault B Capture Channel" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC0" edc:desc="Capture value stored in channel 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CC1" edc:desc="Capture value stored in channel 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CC2" edc:desc="Capture value stored in channel 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CC3" edc:desc="Capture value stored in channel 3" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CAPTURE" edc:desc="Fault B Capture Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No capture" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Capture on fault" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="LOCMIN" edc:desc="Minimum local detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOCMAX" edc:desc="Maximum local detection" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DERIV0" edc:desc="Minimum and maximum local detection" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMARK" edc:desc="Capture with ramp index as MSB value" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLANKPRESC" edc:desc="Fault B Blanking Prescaler" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANKVAL" edc:desc="Fault B Blanking Time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL" edc:desc="Fault B Filter Value" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
