Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0x46000028" edc:access="nn-nnnnn" edc:cname="HC1R" edc:impl="0xDF" edc:mclr="111000000000" edc:nzwidth="0x8" edc:por="111000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="LEDCTRL" edc:desc="LED Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="LED off" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="LED on" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DW" edc:desc="Data Width" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="1BIT" edc:desc="1-bit mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="4BIT" edc:desc="4-bit mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="HSEN" edc:desc="High Speed Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Speed mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High Speed mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMASEL" edc:desc="DMA Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SDMA" edc:desc="SDMA is selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="32BIT" edc:desc="32-bit Address ADMA2 is selected" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CARDDTL" edc:desc="Card Detect Test Level" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Card" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card Inserted" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDDSEL" edc:desc="Card Detect Signal Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="SDCD# is selected (for normal use)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TEST" edc:desc="The Card Select Test Level is selected (for test purpose)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000029" edc:access="----nnnn" edc:cname="PCR" edc:impl="0xF" edc:mclr="00001110" edc:nzwidth="0x8" edc:por="00001110" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDBPWR" edc:desc="SD Bus Power" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Power off" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Power on" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDBVSEL" edc:desc="SD Bus Voltage Select" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="1V8" edc:desc="1.8V (Typ.)" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="3V0" edc:desc="3.0V (Typ.)" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="3V3" edc:desc="3.3V (Typ.)" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600002A" edc:access="----nnnn" edc:cname="BGCR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="STPBGR" edc:desc="Stop at Block Gap Request" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Transfer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Stop" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTR" edc:desc="Continue Request" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="GO_ON" edc:desc="Not affected" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Restart" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWCTRL" edc:desc="Read Wait Control" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable Read Wait Control" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable Read Wait Control" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INTBG" edc:desc="Interrupt at Block Gap" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600002B" edc:access="-----nnn" edc:cname="WCR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="WKENCINT" edc:desc="Wakeup Event Enable on Card Interrupt" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKENCINS" edc:desc="Wakeup Event Enable on Card Insertion" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WKENCREM" edc:desc="Wakeup Event Enable on Card Removal" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
