Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0xE0000EFC" edc:access="-------------------------------r" edc:cname="IRR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="ATREADYM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0000F00" edc:offset="0xD0"/>
      <edc:SFRDef edc:_addr="0xE0000FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:mclr="00000000000000000000000010110000" edc:nzwidth="0x20" edc:por="00000000000000000000000010110000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:mclr="00000000000000000000000000111011" edc:nzwidth="0x20" edc:por="00000000000000000000000000111011" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:mclr="00000000000000000000000011100000" edc:nzwidth="0x20" edc:por="00000000000000000000000011100000" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0000FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="ITM"/>
      <edc:SFRDef edc:_addr="0xE0001000" edc:access="nnnnnnnn-nnnnnnn---nnnnnnnnnnnnn" edc:cname="CTRL" edc:impl="0xFF7F1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CYCCNT" edc:nzwidth="0x20" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001008" edc:access="------------------------nnnnnnnn" edc:cname="CPICNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CPICNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000100C" edc:access="------------------------nnnnnnnn" edc:cname="EXCCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="EXCCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001010" edc:access="------------------------nnnnnnnn" edc:cname="SLEEPCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLEEPCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
