Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:AdjustPoint edc:_addr="0xE000104C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0001050" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="COMP3" edc:nzwidth="0x20" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001054" edc:access="---------------------------nnnnn" edc:cname="MASK3" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001058" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:cname="FUNCTION3" edc:impl="0x10FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000105C" edc:offset="0xCFA8"/>
      <edc:SFRDef edc:_addr="0xE000E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:desc="Interrupt Controller Type Register" edc:impl="0xF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32." edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E008" edc:access="----------------------nn-----nnn" edc:cname="ACTLR" edc:impl="0x307" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="DISMCYCINT" edc:desc="Disable interruption of LDM/STM instructions" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISDEFWBUF" edc:desc="Disable wruite buffer use during default memory map accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISFOLD" edc:desc="Disable IT folding" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="DISFPCA" edc:desc="Disable automatic update of CONTROL.FPCA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISOOFP" edc:desc="Disable out-of-order FP instructions" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E00C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000E010" edc:access="---------------n-------------nnn" edc:cname="CSR" edc:impl="0x10007" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SysTick Counter Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counter disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counter enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:desc="SysTick Exception Request Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counting down to 0 does not assert the SysTick exception request" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counting down to 0 asserts the SysTick exception request" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:desc="Clock Source 0=external, 1=processor" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="External clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Processor clock" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:desc="Timer counted to 0 since last read of register" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E014" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RVR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="RELOAD" edc:desc="Value to load into the SysTick Current Value Register when the counter reaches 0" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E018" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="CURRENT" edc:desc="Current value at the time the register is accessed" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E01C" edc:access="rr------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CALIB" edc:impl="0xC0FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SysTick">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="TENMS" edc:desc="Reload value to use for 10ms timing" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SKEW" edc:desc="TENMS is rounded from non-integer ratio" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="10ms calibration value is exact" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="10ms calibration value is inexact, because of the clock frequency" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NOREF" edc:desc="No Separate Reference Clock" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="The reference clock is provided" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="The reference clock is not provided" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E020" edc:offset="0xE0"/>
      <edc:SFRDef edc:_addr="0xE000E100" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETENA" edc:desc="Interrupt set enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E104" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISER1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETENA" edc:desc="Interrupt set enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E108" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISER2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETENA" edc:desc="Interrupt set enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E10C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISER3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETENA" edc:desc="Interrupt set enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E110" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISER4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="SETENA" edc:desc="Interrupt set enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000E114" edc:offset="0x6C"/>
      <edc:SFRDef edc:_addr="0xE000E180" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ICER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRENA" edc:desc="Interrupt clear-enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E184" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ICER1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRENA" edc:desc="Interrupt clear-enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E188" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ICER2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRENA" edc:desc="Interrupt clear-enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E18C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ICER3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRENA" edc:desc="Interrupt clear-enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000E190" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ICER4" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="CLRENA" edc:desc="Interrupt clear-enable bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
