Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:_addr="0xE0040FCC" edc:access="------------------------rrrrrrrr" edc:cname="DEVTYPE" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TPIU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="SubType" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MajorType" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0040FD0" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0xE0041000" edc:access="---n------n---nn--n-nnnnnnnn---n" edc:cname="CR" edc:impl="0x10232FF1" edc:mclr="00000000000000000000010000010001" edc:nzwidth="0x20" edc:por="00000000000000000000010000010001" ltx:memberofperipheral="ETM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="ETMPD" edc:desc="ETM Power Down" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE" edc:desc="Port Size bits 2:0" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="Stall Processor" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BROUT" edc:desc="Branch Output" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBGRQ" edc:desc="Debug Request Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROG" edc:desc="ETM Programming" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORTSEL" edc:desc="ETM Port Select" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PORTMODE2" edc:desc="Port Mode bit 2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTMODE" edc:desc="Port Mode bits 1:0" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE3" edc:desc="Port Size bit 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:desc="TimeStamp Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0041004" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CCR" edc:mclr="10001100100000000010000000000000" edc:nzwidth="0x20" edc:por="10001100100000000010000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TRIGGER" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE004100C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041014" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SCR" edc:mclr="00000000000000100000110100001001" edc:nzwidth="0x20" edc:por="00000000000000100000110100001001" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041018" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE0041020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TEEVR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041024" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TECR1" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041028" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FFLR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE004102C" edc:offset="0x114"/>
      <edc:SFRDef edc:_addr="0xE0041140" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNTRLDVR1" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041144" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0xE00411E0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="SYNCFR" edc:mclr="00000000000000000000010000000000" edc:nzwidth="0x20" edc:por="00000000000000000000010000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE00411E4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IDR" edc:mclr="01000001000101001111001001010000" edc:nzwidth="0x20" edc:por="01000001000101001111001001010000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE00411E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CCER" edc:mclr="00011000010101000001100000000000" edc:nzwidth="0x20" edc:por="00011000010101000001100000000000" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE00411EC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE00411F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TESSEICR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE00411F4" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE00411F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TSEVT" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE00411FC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041200" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TRACEIDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041204" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041208" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IDR2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE004120C" edc:offset="0x108"/>
      <edc:SFRDef edc:_addr="0xE0041314" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PDSR" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041318" edc:offset="0xBC8"/>
      <edc:SFRDef edc:_addr="0xE0041EE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ITMISCIN" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041EE4" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041EE8" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ITTRIGOUT" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041EEC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041EF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ITATBCTR2" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041EF4" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041EF8" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="ITATBCTR0" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041EFC" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE0041F00" edc:access="-------------------------------n" edc:cname="ITCTRL" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="INTEGRATION" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
