Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.5.87/edc/ATSAME53N19A.PIC
      <edc:SFRDef edc:access="-------------nnnnn---nnn--------" edc:addr="0x43000C04" edc:cname="CTRLB" edc:impl="0x7C700" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Smart Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCMD" edc:desc="PMBus Group Command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AACKEN" edc:desc="Automatic Address Acknowledge" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ACKACT" edc:desc="Acknowledge Action" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnnnnnnnnn-n----nnnnnnnnnnn" edc:addr="0x43000C24" edc:cname="ADDR" edc:impl="0x7FE87FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="GENCEN" edc:desc="General Call Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TENBITEN" edc:desc="Ten Bit Addressing Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n--------------------nnnn" edc:addr="0x43000C08" edc:cname="CTRLC" edc:impl="0x100000F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="SDASETUP" edc:desc="SDA Setup Time" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:desc="Data 32 Bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_8BIT" edc:desc="Data transaction from/to DATA register are 8-bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_32BIT" edc:desc="Data transaction from/to DATA register are 32-bit" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x43000C28" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x43000C14" edc:cname="INTENCLR" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x43000C16" edc:cname="INTENSET" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n----nnn" edc:addr="0x43000C18" edc:cname="INTFLAG" edc:impl="0x87" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="Combined Error Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnn-nn-nnnnn" edc:addr="0x43000C1A" edc:cname="STATUS" edc:impl="0xEDF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="BUSERR" edc:desc="Bus Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:desc="Transmit Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXNACK" edc:desc="Received Not Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Read/Write Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR" edc:desc="Repeated Start" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOWTOUT" edc:desc="SCL Low Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKHOLD" edc:desc="Clock Hold" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEXTTOUT" edc:desc="Slave SCL Low Extend Timeout" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HS" edc:desc="High Speed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LENERR" edc:desc="Transaction Length Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="---------------------------r--rr" edc:addr="0x43000C1C" edc:cname="SYNCBUSY" edc:impl="0x13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SERCOM Enable Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="Length Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="TC4/COUNT16">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0x42001430" edc:cname="CCBUF0" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Counter/Compare Buffer Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
